#Условный оператор. Задача 10
print("Добро пожаловать в квест!")
print("Начинаем!")
quest1 = input()
quest2 = input()
quest3 = input()

if quest1 == "да" and quest2 == "да":
        result = "Уют и романтика — твоё всё: и тёплый чай, и тихий дождь радуют сердце."
elif quest1 == "да" and quest2 == "нет":
        result = "Вы цените домашний уют: чай — да, а дождь лучше из окна наблюдать."
elif quest1 == "нет" and quest2 == "да":
        result = "Вы — любитель приключений: дождь не пугает, а чай не обязателен."
else:  # quest1 == "нет" и quest2 == "нет"
        result = "Вы предпочитаете активность и ясность: ни чая, ни дождя — зато есть энергия для дел!"
print("Ваш результат:", result)