#Условный оператор. Задача 10
print("Добро пожаловать в квест!")
print("Ты студент. На часах 00:00. Завтра экзамен.")

# Стартовые вопросы
print("Что делаешь?")
print("1 — Открыть конспект и начать читать") #q1
print("2 — Позвонить одногруппнику") #q2
print("3 — Лечь спать") #q3
choice1 = input("Твой выбор (1/2/3): ")

# Ветка "Читать конспект"
if choice1 == "1": #q1
    print("Через полчаса глаза слипаются.")
    print("1 — Заварить кофе и продолжить") #q1/1
    print("2 — Лечь спать") #q1/2
    choice2 = input("Твой выбор (1/2): ")

    if choice2 == "1": #q1/1
        print("Кофе взбодрил, ты дочитал конспект до конца. Кажется, что-то понял.")
        print("1 - Повторить ключевые темы ещё раз") #q1/1/1
        print("2 - Лечь спать") #q1/1/2
        choice3 = input("Твой выбор (1/2): ")

        if choice3 == "1": #q1/1/1
            print("Будильник утром не прозвенел и ты проспал пару.")
        else: #q1/1/2
            print("Ты выспался и кое-что запомнил. Но пару отменили.")

    elif choice2 == "2": #q1/2
        print("1 - Ты решил, что сон важнее.") #q1/2/1
        print("2 - Ты решил, что экзамен никуда не денется.") #q1/2/2
        choice3 = input("Твой выбор (1/2): ")

        if choice3 == "1": #q1/2/1
            print("Ты выбрал быть счастливым.")
        else: #q1/2/2
            print("Вытянул счастливый билет - получил пятерку автоматом.")

# Ветка "Позвонить одногруппнику"
elif choice1 == "2": #q2
    print("Одногруппник скидывает конспекты, но там два тома.")
    print("1 - Читать всё подряд до утра") #q2/1
    print("2 - Попросить выделить главное") #q2/2
    choice2 = input("Твой выбор (1/2): ")

    if choice2 == "1": #q2/1
        print("Ты не спал, но прочитал все страницы. Проспал пару.")

    elif choice2 == "2": #q2/2
        print("Одногруппник прислал 5 главных тем. Ты быстро повторил их.")
        print("1 — Поиграть в PUBG и лечь спать пораньше")
        print("2 — Заучить эти темы наизусть")
        choice3 = input("Твой выбор (1/2): ")

        if choice3 == "1":
            print("На экзамене поставили автоматом пятерку. У преподавателя было хорошее настроение.")

        elif choice3 == "2":
            print("Попалась тема, которую ты изучил хорошо! Экзамен сдал!")


#Ветка "Лечь спать"
elif choice1 == "3": #q3
    print("Ты просыпаешься за 20 минут до экзамена.")
    print("1 - Бежать в аудиторию") #q3/1
    print("2 - Взять конспект у друга в коридоре") #q3/2
    choice2 = input("Твой выбор (1/2): ")

    if choice2 == "1": #q3/1
        print("Ты пришёл вовремя. Рассказал то, что знал, экзамен сдал.") #q3/1/1

    elif choice2 == "2": #q3/2
        print("Ты зашел в аудиторию с чужим конспектом.")
        print("1 — Ответить по памяти то, что успел прочитать") #q3/2/1
        print("2 — Признаться преподавателю, что не выспался") #q3/2/2
        choice3 = input("Твой выбор (1/2): ")

        if choice3 == "1": #q3/2/1
            print("Ответил то, что запомнил. Экзамен сдал.")

        elif choice3 == "2": #q3/2/2
            print("Ты честно сказал, что не выспался. Преподаватель оценил прямоту")

else:
    print("Такого варианта нет.")
